In [2]:
import numpy as np
import pandas as pd

In [4]:
my_series = pd.Series ( data=[2,3,4,5] ,
                        index = ['a' , 'b' , 'c' , 'd'])

my_series

a    2
b    3
c    4
d    5
dtype: int64

In [5]:
my_dict = {"x" : 2 , "y" : 5 , "z" : 4 , "a" : 8}
my_series2 = pd.Series(my_dict)
my_series2

x    2
y    5
z    4
a    8
dtype: int64

In [6]:
my_series[ "a"]

2

In [7]:
my_series[1:3]

b    3
c    4
dtype: int64

In [8]:
my_series + my_series

a     4
b     6
c     8
d    10
dtype: int64

In [9]:
my_series + my_series2

a    10.0
b     NaN
c     NaN
d     NaN
x     NaN
y     NaN
z     NaN
dtype: float64

In [12]:
np.mean(my_series)

3.5

In [8]:
import numpy as np
import pandas as pd

#create a dictionary with some different data types as  values
my_dict = { "name" : [ "Praju" , "Uma" , "Prachi"] ,
            "age" : np.array([10,20,50]) , 
            "weight" : (40 , 41 , 36) , 
            "height" : pd.Series ([4.8 , 5.3 , 5.4] ,
                                index = ["Praju" , "Uma" , "Prachi"] ) , 
                "siblings" : 1 , 
                "gender" : "F"}

df = pd. DataFrame(my_dict)            #convert the dictionary to dataframe
df                                     #print data frame

          name  age  weight  height  siblings gender
Praju    Praju   10      40     4.8         1      F
Uma        Uma   20      41     5.3         1      F
Prachi  Prachi   50      36     5.4         1      F

In [19]:
import numpy as np
import pandas as pd

#create a dictionary with some different data types as  values
my_dict2 = { "name" : [ "Praju" , "Uma" , "Prachi"] ,
            "age" : np.array([10,20,50]) , 
            "weight" : (40 , 41 , 36) , 
            "height" : [4.8 , 5.3 , 5.4] ,
            "siblings" : 1 , 
            "gender" : "F" }

df2 = pd. DataFrame(my_dict2)            #convert the dictionary to dataframe
df2                                     #print data frame

     name  age  weight  height  siblings gender
0   Praju   10      40     4.8         1      F
1     Uma   20      41     5.3         1      F
2  Prachi   50      36     5.4         1      F

In [30]:
df2 = pd.DataFrame (my_dict2 , index = my_dict ["name"])
df2

          name  age  weight  height  siblings gender
Praju    Praju   10      40     4.8         1      F
Uma        Uma   20      41     5.3         1      F
Prachi  Prachi   50      36     5.4         1      F

In [31]:
#Get a column by name 
df2["weight"]

Praju     40
Uma       41
Prachi    36
Name: weight, dtype: int64

In [32]:
df2.weight

Praju     40
Uma       41
Prachi    36
Name: weight, dtype: int64

In [34]:
#Delete a column
del df2['name']
df2

        age  weight  height  siblings gender   IQ
Praju    10      40     4.8         1      F  130
Uma      20      41     5.3         1      F  115
Prachi   50      36     5.4         1      F  105

In [35]:
#Add a new column
df2["IQ"] = [130 , 115, 105]
df2

        age  weight  height  siblings gender   IQ
Praju    10      40     4.8         1      F  130
Uma      20      41     5.3         1      F  115
Prachi   50      36     5.4         1      F  105

In [36]:
df2["Married"] = False
df2

        age  weight  height  siblings gender   IQ  Married
Praju    10      40     4.8         1      F  130    False
Uma      20      41     5.3         1      F  115    False
Prachi   50      36     5.4         1      F  105    False

In [37]:
df2["college"] = pd.Series (["Harvard"] , index = ["Uma"])
df2

        age  weight  height  siblings gender   IQ  Married  college
Praju    10      40     4.8         1      F  130    False      NaN
Uma      20      41     5.3         1      F  115    False  Harvard
Prachi   50      36     5.4         1      F  105    False      NaN

In [38]:
df2.loc["Prachi"]

age            50
weight         36
height        5.4
siblings        1
gender          F
IQ            105
Married     False
college       NaN
Name: Prachi, dtype: object

In [39]:
df2.loc["Prachi" , "IQ"]

105

In [40]:
df2.loc["Praju" : "Uma" , "IQ" : "college"]

        IQ  Married  college
Praju  130    False      NaN
Uma    115    False  Harvard

In [41]:
df2.iloc[0]

age            10
weight         40
height        4.8
siblings        1
gender          F
IQ            130
Married     False
college       NaN
Name: Praju, dtype: object

In [42]:
df2.iloc[0,5]

130

In [43]:
df2.iloc[0:2 , 5:8]

        IQ  Married  college
Praju  130    False      NaN
Uma    115    False  Harvard

In [45]:
boolean_index = [False , True , True]
df2[boolean_index]

        age  weight  height  siblings gender   IQ  Married  college
Uma      20      41     5.3         1      F  115    False  Harvard
Prachi   50      36     5.4         1      F  105    False      NaN

In [46]:
boolean_index = df2["age"]>12
df2[boolean_index]

        age  weight  height  siblings gender   IQ  Married  college
Uma      20      41     5.3         1      F  115    False  Harvard
Prachi   50      36     5.4         1      F  105    False      NaN

In [48]:
df2 [ df2["age"] > 12]

        age  weight  height  siblings gender   IQ  Married  college
Uma      20      41     5.3         1      F  115    False  Harvard
Prachi   50      36     5.4         1      F  105    False      NaN